батьки('Олексій','Олена').
батьки('Олексій','Галина').
батьки('Оксана','Олена').
батьки('Оксана','Галина').
батьки('Зінаїда','Петро').
батьки('Зінаїда','Василь').
батьки('Богдан','Петро').
батьки('Богдан','Василь').
батьки('Максим','Григорій').
батьки('Валерія','Григорій').
батьки('Іван','Марина').
батьки('Іван','Анатолій').
батьки('Іван','Світлана').
батьки('Лариса','Марина').
батьки('Лариса','Анатолій').
батьки('Лариса','Світлана').
батьки('Галина','Олександр').
батьки('Петро','Олександр').
батьки('Григорій','Наталія').
батьки('Григорій','Віктор').
батьки('Марина','Наталія').
батьки('Марина','Віктор').
батьки('Олександр','Сергій').
батьки('Олександр','Катерина').
батьки('Наталія','Сергій').
батьки('Наталія','Катерина').

чоловік('Олексій').
чоловік('Віктор').
чоловік('Богдан').
чоловік('Максим').
чоловік('Іван').
чоловік('Петро').
чоловік('Василь').
чоловік('Григорій').
чоловік('Анатолій').
чоловік('Олександр').
чоловік('Сергій').
жінка('Оксана').
жінка('Зінаїда').
жінка('Олена').
жінка('Валерія').
жінка('Лариса').
жінка('Галина').
жінка('Марина').
жінка('Світлана').
жінка('Наталія').
жінка('Катерина').

подружжя('Олексій','Оксана').
подружжя('Богдан','Зінаїда').
подружжя('Максим','Валерія').
подружжя('Іван','Лариса').
подружжя('Петро','Галина').
подружжя('Григорій','Марина').
подружжя('Олександр','Наталія').


батько(X, Y) :- чоловік(X), батьки(X, Y).
мати(X, Y) :- жінка(X), батьки(X, Y).
діти(X, Y) :- батьки(Z, X), батьки(Z, Y), X \= Y.

% 2 Дідусь(Дід, Онук)
дідусь(X, Y) :- батьки(X, Z), батьки(Z, Y), чоловік(X).

% 11 Бабуся
бабуся(X, Y) :- батьки(X, Z), батьки(Z, Y), жінка(X).

% 22 Сестра
сестра(X, Y) :- жінка(X), діти(X, Y).

% 26 Брат
брат(X, Y) :- чоловік(X), діти(X, Y).

% 6 Дядько
дядько(X, Y) :- чоловік(X), діти(X, Z), батьки(Z, Y).

% 7 Тітка
тітка(X, Y) :- жінка(X), діти(X, Z), батьки(Z, Y).

% 4 Онук
онук(X, Y) :- чоловік(X), батьки(Z, X), батьки(Y, Z).

% 24 Онука
онука(X, Y) :- жінка(X), батьки(Z, X), батьки(Y, Z).

% 1 Двоюрідний брат
двоюріднийБрат(X, Y) :- чоловік(X), тітка(Z, Y), мати(Z, X).
двоюріднийБрат(X, Y) :- чоловік(X), дядько(Z, Y), батько(Z, X).

% 25 Двоюрідна сестра
двоюріднаСестра(X, Y) :- жінка(X), тітка(Z, Y), мати(Z, X).
двоюріднаСестра(X, Y) :- жінка(X), дядько(Z, Y), батько(Z, X).

% 8 Племінник
племінник(X, Y) :- батьки(Z, X), діти(Z, Y), чоловік(X).

% 9 Племінниця
племінниця(X, Y) :- батьки(Z, X), діти(Z, Y), жінка(X).

% 5 Свекруха(Свекруха, Невістка)
свекруха(X, Y) :- подружжя(Z, Y), мати(X, Z).

% 13 Свекор
свекор(X, Y) :- подружжя(Z, Y), батько(X, Z).

% 12 Теща
теща(X, Y) :- подружжя(Y, Z), мати(X, Z).

% 21 Тесть
тесть(X, Y) :- подружжя(Y, Z), батько(X, Z).

% 3 Дівер, брат чоловіка
дівер(X, Y) :- подружжя(Y, _), брат(Y, X).

% 16 Шурин, брат дружини
шурин(X, Y) :- подружжя(_, Y), брат(X, Y).

% 15 Зовиця, сестра чоловіка
зовиця(X, Y) :- подружжя(Y, _), сестра(X, Y).

% 17 Своячка, сестра дружини
своячка(X, Y) :- подружжя(_, Y), сестра(X, Y).

% 18 Зять
зять(X, Y) :- батьки(Y, Z), подружжя(X, Z), чоловік(X).

% 23 Невістка
невістка(X, Y) :- батьки(Y, Z), подружжя(Z, X), жінка(X).

% 20 Сват
сват(X, Y) :- батьки(X, Z), батьки(Y, R), подружжя(Z, R), чоловік(X), чоловік(Y).

% Сваха
сваха(X, Y) :- батьки(X, Z), батьки(Y, R), подружжя(Z, R), жінка(X), жінка(Y).
